//HashMap არის მონაცემთა სტრუქტურა, რომელიც საშუალებას გვაძლევს შევინახოთ და მივაწვდეთ 
// მონაცემებს გასაღების (key) და მნიშვნელობის (value) წყვილებში.
//HashMap ინახავს მონაცემებს ჰეშირების (hashing) მექანიზმის გამოყენებით
//HashMap -ში შეუძლებელია დუბლირებული გასაღების (key) არსებობა
//HashMap -ში შეიძლება დუბლირებული მნიშვნელობის (value) არსებობა
//მის დასაიმპორტებლად უნდა გამოიყენოთ შემდეგი კოდი: const HashMap = require('./HashMap');
//HashMap იქმნება შემდეგი ფორმით: const myMap = new HashMap();
//ახალი ელემენტის დასამატებლად ვიყენებთ შემდეგ მეთოდს: myMap.set(key, value);
//myMap.get(key); ვიყენებთ კონკრეტული გასაღების (key) მნიშვნელობის (value) მისაღებად
//თუ უკვე არსებულ გასაღებზე ვცადით მნიშვნელობის შეტანას ხდება Collision
//ელემენტეის წასაშლელად ვიყენებთ შემდეგ მეთოდს: myMap.delete(key);
// keySet() მეთოდი აბრუნებს HashMap-ში არსებული ყველა გასაღების (key) ნაკრებს (set).
// values() მეთოდი აბრუნებს HashMap-ში არსებული ყველა მნიშვნელობის (value) ნაკრებს (collection).
// entrySet() მეთოდი აბრუნებს HashMap-ში არსებული ყველა გასაღების (key) და მნიშვნელობის (value) წყვილების ნაკრებს (set).
//  keySet() მეთოდი მხოლოდ გასაღების (key) ნაკრებს აბრუნებს, ხოლო entrySet() მეთოდი აბრუნებს როგორც გასაღების (key), ასევე მნიშვნელობის (value) წყვილების ნაკრებს.
//  HashMap-ის ყველა ელემენტის წასაშლელად შეგიძლიათ გამოიყენოთ clear() მეთოდი: myMap.clear();